Autodesk.Navisworks.Api.FileResolvedEventArgs
Event arguments used for the Application::FileResolved event

Autodesk.Navisworks.Api.FileResolvedEventArgs.FileNameToOpen
Get file name to open to read contents of resolved reference. Same as ResolvedFileReference
if file is local. Null if not resolved or file is remote and has not been downloaded.

Autodesk.Navisworks.Api.FileResolvedEventArgs.ResolvedFileReference
Get file reference that FileReference has been resolved to, or null if not resolved

Autodesk.Navisworks.Api.FileResolvedEventArgs.ResolvedFileReferenceType
Get type of file reference to be resolved